/*! \file  debug.c
* \b 接口说明：  
*
*       1. print_run_time: 打印时间 <br>
*
* \b 功能描述:
*
*       调试
*
* \b 历史记录:     
*
*     <作者>        <时间>      <修改记录> <br>
*     zuokongxiao  2014-06-12   创建文件   <br>
*/

/******************************************************************************/
/*                            头文件                                          */
/******************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
#include <errno.h>
#include <unistd.h>
#include <sys/time.h>
#include "../include/deftype.h"

/******************************************************************************/
/*                           宏定义                                           */
/******************************************************************************/

/******************************************************************************/
/*                           变量定义                                         */
/******************************************************************************/

/******************************************************************************/
/*                         内部接口声明                                       */
/******************************************************************************/


/******************************************************************************/
/*                         内部接口实现                                       */
/******************************************************************************/

/******************************************************************************/
/*                         外部接口实现                                       */
/******************************************************************************/
/*! \fn       void print_run_time(void)
*
*  \brief     打印时间
*
*  \param     pFile [in] __FILE__
*
*  \exception 无
*
*  \return    无
*/
void print_run_time(char *pFile, int lLine)
{
    //time_t cur_time;
    struct timeval cur_time;
    struct tm *pstTm;
    int lStringSize = 0, i = 0;
    
    /* 获取当前时间 */
    //cur_time = time((time_t *)0);
    gettimeofday(&cur_time, NULL);
    pstTm = localtime(&(cur_time.tv_sec));
    /* 打印时间 */
    printf("[%04d-%02d-%02d %02d:%02d:%02d:%03ld] ", pstTm->tm_year+1900, pstTm->tm_mon+1, \
        pstTm->tm_mday, pstTm->tm_hour, pstTm->tm_min, pstTm->tm_sec, (cur_time.tv_usec)/1000);

    /* 打印文件名及其行号 */
    /*! 计算__FILE__字符串长度 */
    lStringSize = strlen(pFile);
    /*! 只打印最后一个“\”后的内容 */
    for(i = (lStringSize - 1); i != 0; i--)
    {
        if('/' == *(pFile + i))
        {
            break;
        }
    }
    printf("[%s:%d] ", (pFile+i), lLine);
}

/********************************end of file***********************************/

